/*******************************************************************************
* Description  : 系统参数
* Author       : 2018/4/12 星期四, by redmorningcn
*******************************************************************************/


#ifndef	APP_H
#define	APP_H

#ifdef __cplusplus
extern "C" {
#endif

    
/*******************************************************************************
 * INCLUDES
 */
#include <global.h>
#include <app_wave.h>
#include <includes.h>

    

/*******************************************************************************
 * CONSTANTS
 */

/*******************************************************************************
 * MACROS
 */

/*******************************************************************************
 * TYPEDEFS
 */
/*******************************************************************************
* Description  : 系统运行参数
* Author       : 2018/3/14 星期三, by redmorningcn
*******************************************************************************/
__packed
typedef struct  
{
    uint32  id;             // 产品id       0
    uint32  num;            // 产品编号     4
    
    union{
        struct{
            u16  sysflg                 :1; // 存系统参数 
            u16  califlg                :1; // 存校准参数
            u16  ChangeFreqflg          :1; // 改变频率值
            u16  rev                    :6; // 预留
        };
        u16  flags;
    }paraflg;                            //8
      
    /**************************************************************
    * Description  : 波形产生参数
    * Author       : 2022/01/19 星期四, by redmorningcn
    */
    struct{
        u32     CHtime;                 //通道时间  10
        u16     LocoDim;                //机车轮径  14
        u16     PluseNum;               //脉冲常数  16
        u16     setSpeed;               //设置速度值 18
        u16     SetMode;                //设置运行模式（可根据模式，选择低速，均加速，定值等模式运行）//20
        u16     setfrq;                 //设置频率值0-50000hz   22
        u16     setphase;               //超前还是滞后，相位关系 1-2，相位范围0-360，相位0-180，1超前2；相位180-360， //24
        u16     setCH[6];               //各通道参数，设置占空比0-100%    //26
        u16     vccCH[6];               //各通道电压                     //38 
        u16     speedCH[6];             //各通道速度                     //50        
    };     
    
    uint8   buf[30];                    // 预留          8
    uint32  cpu_freq;                   // cpu频率      72
    uint32  time;                       // 系统全局时间(系统时钟(1/72Mhz) *65536)=约1ms   76
}strSysPara;    
    

__packed
typedef union _Unnctrl_ {
    struct{
        strSysPara          sys;        //公共参数
        //strCoupleChannel    ch;         //产品特有参数    
        //strCaliTable        calitab;    //修正系数
        MODBUS_CH   	    *pch;       //modbus控制块

    };
    uint16   buf[1024];
        
}Unnctrl;

extern  Unnctrl Ctrl;      


/*******************************************************************************
 * TYPEDEFS
 */ 
#define     STORE_ADDR_SYS      (0)                                     /* 存sys地址     */
#define     STORE_ADDR_CALI     (STORE_ADDR_SYS + sizeof(strSysPara))   /* 存校验地址    */

/**************************************************************
* Description  : 校准额定值
* Author       : 2018/5/30 星期三, by redmorningcn
*/
#define     CALI_LINE_BASE      (10000)         /*  线性度基准        */
#define     CALI_LINE_MIN       (8500)          /*  线性度最小偏大-15% */
#define     CALI_LINE_MAX       (11500)         /*  线性度最大偏大 15% */  
#define     CALI_DELTA_BASE     (0)             /*  偏差基准          */      
#define     CALI_DELTA_MIN      (-500)          /*  允许调整的偏差-0.5*/    
#define     CALI_DELTA_MAX      (500)           /*  允许调整的偏差 0.5*/    
     

/**************************************************************
* Description  : 丢脉冲判断依据
* Author       : 2018/5/30 星期三, by redmorningcn
*/


#define     CIRCLE_PLUSE_NUM    (200)           /* 一圈脉冲常数（200或72）                  */


/*******************************************************************************
 * TYPEDEFS
 */ 
#define     STORE_ADDR_SYS      (0)                                     /* 存sys地址     */
#define     STORE_ADDR_CALI     (STORE_ADDR_SYS + sizeof(strSysPara))   /* 存校验地址    */


/***********************************************
* 描述： 软定时器外部引用声明
*/


/***********************************************
* 描述： 软定时器回调函数外部引用声明
*/


/***********************************************
* 描述： 看门狗标志组外部引用声明
*/


/*******************************************************************************
 * LOCAL VARIABLES
 */

/*******************************************************************************
 * GLOBAL VARIABLES
 */


/*******************************************************************************
 * LOCAL FUNCTIONS
 */

/*******************************************************************************
 * GLOBAL FUNCTIONS
 */
/******************************************************
* 描述： 任务创建申明，每个单独的创建任务请在此处声明
*/


/*******************************************************************************
 * EXTERN VARIABLES
 */

/*******************************************************************************
 * EXTERN FUNCTIONS
 */

/*******************************************************************************
 *              end of file                                                    *
 *******************************************************************************/
#ifdef __cplusplus
}
#endif
#endif
