/*******************************************************************************
* Description  : 系统参数
* Author       : 2018/4/12 星期四, by redmorningcn
*******************************************************************************/


#ifndef	APP_H
#define	APP_H

#ifdef __cplusplus
extern "C" {
#endif

    
/*******************************************************************************
 * INCLUDES
 */
#include <global.h>
#include <app_wave.h>
#include <includes.h>

    

/*******************************************************************************
 * CONSTANTS
 */

/*******************************************************************************
 * MACROS
 */

/*******************************************************************************
 * TYPEDEFS
 */
/*******************************************************************************
* Description  : 系统运行参数
* Author       : 2018/3/14 星期三, by redmorningcn
*******************************************************************************/
__packed
typedef struct  
{
    uint32  id;             // 产品id       0
    uint32  num;            // 产品编号     4
    
    union{
        struct{
            u16  sysflg      :1; // 存系统参数 
            u16  califlg     :1; // 存校准参数
            u16  rev         :6; // 预留
        };
        u16  flags;
    }paraflg;
      
    /**************************************************************
    * Description  : 丢脉冲计算参数
    * Author       : 2018/7/19 星期四, by redmorningcn
    */
    struct{
        u16     periodcali;     //丢脉冲，周期系数*10（10-30）
        u16     loseerrtimes;       //丢脉冲次数。默认4次连续。
    };     
    
    struct{
        u16     ref_limitvol_min;    //参考电压（最小值） 默认值：750(750)       可设置范围 (600-800)
        u16     ref_limitvol_max;    //参考电压（最大值） 默认值：1500（2.0V）   可设置范围 (1200-1800)
    };
    
    uint8   buf[54];        // 预留         8
    uint32  cpu_freq;       // cpu频率      72
    uint32  time;           // 系统全局时间(系统时钟(1/72Mhz) *65536)=约1ms   76
}strSysPara;    
    

__packed
typedef union _Unnctrl_ {
    struct{
        strSysPara          sys;        //公共参数
        strCoupleChannel    ch;         //产品特有参数    
        strCaliTable        calitab;    //修正系数
        MODBUS_CH   	    *pch;       //modbus控制块

    };
    uint16   buf[1024];
        
}Unnctrl;

extern  Unnctrl Ctrl;      


/*******************************************************************************
 * TYPEDEFS
 */ 
#define     STORE_ADDR_SYS      (0)                                     /* 存sys地址     */
#define     STORE_ADDR_CALI     (STORE_ADDR_SYS + sizeof(strSysPara))   /* 存校验地址    */

/**************************************************************
* Description  : 校准额定值
* Author       : 2018/5/30 星期三, by redmorningcn
*/
#define     CALI_LINE_BASE      (10000)         /*  线性度基准        */
#define     CALI_LINE_MIN       (8500)          /*  线性度最小偏大-15% */
#define     CALI_LINE_MAX       (11500)         /*  线性度最大偏大 15% */  
#define     CALI_DELTA_BASE     (0)             /*  偏差基准          */      
#define     CALI_DELTA_MIN      (-500)          /*  允许调整的偏差-0.5*/    
#define     CALI_DELTA_MAX      (500)           /*  允许调整的偏差 0.5*/    
     

/**************************************************************
* Description  : 丢脉冲判断依据
* Author       : 2018/5/30 星期三, by redmorningcn
*/


#define     CIRCLE_PLUSE_NUM    (200)           /* 一圈脉冲常数（200或72）                  */


/*******************************************************************************
 * TYPEDEFS
 */ 
#define     STORE_ADDR_SYS      (0)                                     /* 存sys地址     */
#define     STORE_ADDR_CALI     (STORE_ADDR_SYS + sizeof(strSysPara))   /* 存校验地址    */


/***********************************************
* 描述： 软定时器外部引用声明
*/


/***********************************************
* 描述： 软定时器回调函数外部引用声明
*/


/***********************************************
* 描述： 看门狗标志组外部引用声明
*/


/*******************************************************************************
 * LOCAL VARIABLES
 */

/*******************************************************************************
 * GLOBAL VARIABLES
 */


/*******************************************************************************
 * LOCAL FUNCTIONS
 */

/*******************************************************************************
 * GLOBAL FUNCTIONS
 */
/******************************************************
* 描述： 任务创建申明，每个单独的创建任务请在此处声明
*/


/*******************************************************************************
 * EXTERN VARIABLES
 */

/*******************************************************************************
 * EXTERN FUNCTIONS
 */

/*******************************************************************************
 *              end of file                                                    *
 *******************************************************************************/
#ifdef __cplusplus
}
#endif
#endif
